test/rest-api.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-11-05 Thu 05:21 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>PubSeq REST API</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Pjotr Prins" />
<link rel="Blog stylesheet" type="text/css" href="blog.css" />
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href=""> UP </a>
 |
 <a accesskey="H" href="http://covid19.genenetwork.org/apidoc"> HOME </a>
</div><div id="content">
<h1 class="title">PubSeq REST API</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org2e7d6bb">1. PubSeq REST API</a>
<ul>
<li><a href="#orgc61d641">1.1. Introduction</a></li>
<li><a href="#org368b8a5">1.2. Search for an entry</a></li>
<li><a href="#org2cb1511">1.3. Fetch metadata</a></li>
<li><a href="#orgd3ad7fd">1.4. Fetch EBI XML</a></li>
</ul>
</li>
<li><a href="#org77f889e">2. Configure emacs to run tests</a></li>
</ul>
</div>
</div>

<div id="outline-container-org2e7d6bb" class="outline-2">
<h2 id="org2e7d6bb"><span class="section-number-2">1</span> PubSeq REST API</h2>
<div class="outline-text-2" id="text-1">
<p>
Here we document the public REST API that comes with PubSeq. The tests
run in emacs <a href="https://orgmode.org/worg/org-contrib/babel/languages/ob-doc-python.html">org-babel</a>.  See the bottom of this document for running
the tests inside emacs. See bottom of the page how to run tests.
</p>
</div>

<div id="outline-container-orgc61d641" class="outline-3">
<h3 id="orgc61d641"><span class="section-number-3">1.1</span> Introduction</h3>
<div class="outline-text-3" id="text-1-1">
<p>
We built a REST API for COVID-19 PubSeq. The API source code can be
found in <a href="https://github.com/arvados/bh20-seq-resource/tree/master/bh20simplewebuploader/api.py">api.py</a>. To see if the service is up try
</p>

<div class="org-src-container">
<pre class="src src-sh">curl http://covid19.genenetwork.org/api/version
</pre>
</div>

<div class="org-src-container">
<pre class="src src-js">{
  <span style="color: #9ccc65;">"service"</span>: <span style="color: #9ccc65;">"PubSeq"</span>,
  <span style="color: #9ccc65;">"version"</span>: 0.1
}
</pre>
</div>

<p>
The Python3 version is
</p>

<div class="org-src-container">
<pre class="src src-python"><span style="color: #fff59d;">import</span> requests
<span style="color: #ffcc80;">baseURL</span>=<span style="color: #9ccc65;">"http://localhost:5067"</span> <span style="color: #b0bec5;"># </span><span style="color: #b0bec5;">for development</span>
<span style="color: #b0bec5;"># </span><span style="color: #b0bec5;">baseURL="http://covid19.genenetwork.org"</span>
<span style="color: #ffcc80;">response</span> = requests.get(baseURL+<span style="color: #9ccc65;">"/api/version"</span>)
<span style="color: #ffcc80;">response_body</span> = response.json()
<span style="color: #fff59d;">assert</span> response_body[<span style="color: #9ccc65;">"service"</span>] == <span style="color: #9ccc65;">"PubSeq"</span>, <span style="color: #9ccc65;">"PubSeq API not found"</span>
response_body
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-left">service</td>
<td class="org-left">:</td>
<td class="org-left">PubSeq</td>
<td class="org-left">version</td>
<td class="org-left">:</td>
<td class="org-right">0.1</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org368b8a5" class="outline-3">
<h3 id="org368b8a5"><span class="section-number-3">1.2</span> Search for an entry</h3>
<div class="outline-text-3" id="text-1-2">
<p>
When you use the search box on PubSeq it queries the REST end point
for information on the search items. For example
</p>

<div class="org-src-container">
<pre class="src src-python">requests.get(baseURL+<span style="color: #9ccc65;">"/api/search?s=MT533203.1"</span>).json()
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">collection</td>
<td class="org-left">:</td>
<td class="org-left"><a href="http://collections.lugli.arvadosapi.com/c=b16901333ea1754a1e0409bf3caf7d22+126">http://collections.lugli.arvadosapi.com/c=b16901333ea1754a1e0409bf3caf7d22+126</a></td>
<td class="org-left">fasta</td>
<td class="org-left">:</td>
<td class="org-left"><a href="http://collections.lugli.arvadosapi.com/c=b16901333ea1754a1e0409bf3caf7d22+126/sequence.fasta">http://collections.lugli.arvadosapi.com/c=b16901333ea1754a1e0409bf3caf7d22+126/sequence.fasta</a></td>
<td class="org-left">id</td>
<td class="org-left">:</td>
<td class="org-left">MT533203.1</td>
<td class="org-left">info</td>
<td class="org-left">:</td>
<td class="org-left"><a href="http://identifiers.org/insdc/MT533203.1#sequence">http://identifiers.org/insdc/MT533203.1#sequence</a></td>
</tr>
</tbody>
</table>

<p>
where collection is the raw uploaded data. The hash value in <code>c=</code> is
computed on the contents of the Arvados keep <a href="https://doc.arvados.org/v2.0/user/tutorials/tutorial-keep-mount-gnu-linux.html">collection</a> and effectively
acts as a deduplication uuid.
</p>
</div>
</div>

<div id="outline-container-org2cb1511" class="outline-3">
<h3 id="org2cb1511"><span class="section-number-3">1.3</span> Fetch metadata</h3>
<div class="outline-text-3" id="text-1-3">
<p>
Using above collection link you can fetch the metadata in JSON as it
was uploaded originally from the SHeX expression, e.g. using
<a href="https://collections.lugli.arvadosapi.com/c=0015b0d65dfd2e82bb3cee4436bf2893+126/">https://collections.lugli.arvadosapi.com/c=0015b0d65dfd2e82bb3cee4436bf2893+126/</a>
</p>

<p>
But better to use the more advanced sample metadata fetcher
because is does a bit more in terms of expansion
</p>

<div class="org-src-container">
<pre class="src src-python">requests.get(baseURL+<span style="color: #9ccc65;">"/api/sample/MT533203.1.json"</span>).json()
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<tbody>
<tr>
<td class="org-left">collection</td>
<td class="org-left">:</td>
<td class="org-left"><a href="http://collections.lugli.arvadosapi.com/c=b16901333ea1754a1e0409bf3caf7d22+126">http://collections.lugli.arvadosapi.com/c=b16901333ea1754a1e0409bf3caf7d22+126</a></td>
<td class="org-left">date</td>
<td class="org-left">:</td>
<td class="org-right">2020-04-27</td>
<td class="org-left">fasta</td>
<td class="org-left">:</td>
<td class="org-left"><a href="http://collections.lugli.arvadosapi.com/c=b16901333ea1754a1e0409bf3caf7d22+126/sequence.fasta">http://collections.lugli.arvadosapi.com/c=b16901333ea1754a1e0409bf3caf7d22+126/sequence.fasta</a></td>
<td class="org-left">id</td>
<td class="org-left">:</td>
<td class="org-left">MT533203.1</td>
<td class="org-left">info</td>
<td class="org-left">:</td>
<td class="org-left"><a href="http://identifiers.org/insdc/MT533203.1#sequence">http://identifiers.org/insdc/MT533203.1#sequence</a></td>
<td class="org-left">mapper</td>
<td class="org-left">:</td>
<td class="org-left">minimap v. 2.17</td>
<td class="org-left">sequencer</td>
<td class="org-left">:</td>
<td class="org-left"><a href="http://www.ebi.ac.uk/efo/EFO_0008632">http://www.ebi.ac.uk/efo/EFO_0008632</a></td>
<td class="org-left">specimen</td>
<td class="org-left">:</td>
<td class="org-left"><a href="http://purl.obolibrary.org/obo/NCIT_C155831">http://purl.obolibrary.org/obo/NCIT_C155831</a></td>
</tr>
</tbody>
</table>
</div>
</div>



<div id="outline-container-orgd3ad7fd" class="outline-3">
<h3 id="orgd3ad7fd"><span class="section-number-3">1.4</span> Fetch EBI XML</h3>
<div class="outline-text-3" id="text-1-4">
<p>
PubSeq provides an API that is used to export formats that are
suitable for uploading data to EBI/ENA from our <a href="http://covid19.genenetwork.org/export">EXPORT</a> menu. This is
documented <a href="http://covid19.genenetwork.org/blog?id=using-covid-19-pubseq-part6">here</a>.
</p>

<div class="org-src-container">
<pre class="src src-python">requests.get(baseURL+<span style="color: #9ccc65;">"/api/ebi/sample-MT326090.1.xml"</span>).text
</pre>
</div>

<pre class="example" id="orgb2d805a">
&lt;?xml version="1.0" encoding="UTF-8"?&gt;
&lt;SAMPLE_SET&gt;
  &lt;SAMPLE alias="MT326090.1" center_name="COVID-19 PubSeq"&gt;
    &lt;TITLE&gt;COVID-19 PubSeq Sample&lt;/TITLE&gt;
    &lt;SAMPLE_NAME&gt;
      &lt;TAXON_ID&gt;2697049&lt;/TAXON_ID&gt;
      &lt;SCIENTIFIC_NAME&gt;Severe acute respiratory syndrome coronavirus 2&lt;/SCIENTIFIC_NAME&gt;
      &lt;COMMON_NAME&gt;SARS-CoV-2&lt;/COMMON_NAME&gt;
    &lt;/SAMPLE_NAME&gt;
    &lt;SAMPLE_ATTRIBUTES&gt;
      &lt;SAMPLE_ATTRIBUTE&gt;
        &lt;TAG&gt;investigation type&lt;/TAG&gt;
        &lt;VALUE&gt;&lt;/VALUE&gt;
      &lt;/SAMPLE_ATTRIBUTE&gt;
      &lt;SAMPLE_ATTRIBUTE&gt;
        &lt;TAG&gt;sequencing method&lt;/TAG&gt;
        &lt;VALUE&gt;http://purl.obolibrary.org/obo/OBI_0000759&lt;/VALUE&gt;
      &lt;/SAMPLE_ATTRIBUTE&gt;
      &lt;SAMPLE_ATTRIBUTE&gt;
        &lt;TAG&gt;collection date&lt;/TAG&gt;
        &lt;VALUE&gt;2020-03-21&lt;/VALUE&gt;
      &lt;/SAMPLE_ATTRIBUTE&gt;
      &lt;SAMPLE_ATTRIBUTE&gt;
        &lt;TAG&gt;geographic location (latitude)&lt;/TAG&gt;
        &lt;VALUE&gt;&lt;/VALUE&gt;
     &lt;UNITS&gt;DD&lt;/UNITS&gt;
      &lt;/SAMPLE_ATTRIBUTE&gt;
      &lt;SAMPLE_ATTRIBUTE&gt;
        &lt;TAG&gt;geographic location (longitude)&lt;/TAG&gt;
        &lt;VALUE&gt;&lt;/VALUE&gt;
     &lt;UNITS&gt;DD&lt;/UNITS&gt;
      &lt;/SAMPLE_ATTRIBUTE&gt;
      &lt;SAMPLE_ATTRIBUTE&gt;
     &lt;TAG&gt;geographic location (country and/or sea)&lt;/TAG&gt;
     &lt;VALUE&gt;&lt;/VALUE&gt;
      &lt;/SAMPLE_ATTRIBUTE&gt;
      &lt;SAMPLE_ATTRIBUTE&gt;
        &lt;TAG&gt;geographic location (region and locality)&lt;/TAG&gt;
        &lt;VALUE&gt;&lt;/VALUE&gt;
      &lt;/SAMPLE_ATTRIBUTE&gt;
      &lt;SAMPLE_ATTRIBUTE&gt;
        &lt;TAG&gt;environment (material)&lt;/TAG&gt;
        &lt;VALUE&gt;http://purl.obolibrary.org/obo/NCIT_C155831&lt;/VALUE&gt;
      &lt;/SAMPLE_ATTRIBUTE&gt;
      &lt;SAMPLE_ATTRIBUTE&gt;
        &lt;TAG&gt;ENA-CHECKLIST&lt;/TAG&gt;
        &lt;VALUE&gt;ERC000011&lt;/VALUE&gt;
      &lt;/SAMPLE_ATTRIBUTE&gt;
    &lt;/SAMPLE_ATTRIBUTES&gt;
  &lt;/SAMPLE&gt;
&lt;/SAMPLE_SET&gt;
</pre>
</div>
</div>
</div>

<div id="outline-container-org77f889e" class="outline-2">
<h2 id="org77f889e"><span class="section-number-2">2</span> Configure emacs to run tests</h2>
<div class="outline-text-2" id="text-2">
<p>
Execute a code block with C-c C-c. You may need to set
</p>

<div class="org-src-container">
<pre class="src src-elisp">(org-babel-do-load-languages
 'org-babel-load-languages
 '((python . t)))
(<span style="color: #fff59d;">setq</span> org-babel-python-command <span style="color: #9ccc65;">"python3"</span>)
(<span style="color: #fff59d;">setq</span> org-babel-eval-verbose t)
(<span style="color: #fff59d;">setq</span> org-confirm-babel-evaluate nil)
</pre>
</div>

<p>
To skip confirmations you may also want to set
</p>

<pre class="example">
(setq org-confirm-babel-evaluate nil)
</pre>


<p>
To see output of the inpreter open then <b>Python</b> buffer.
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<hr><small>Created by <a href="http://thebird.nl/">Pjotr Prins</a> (pjotr.public768 at thebird 'dot' nl) using Emacs org-mode and a healthy dose of Lisp!<br />Modified 2020-11-05 Thu 05:21</small>.
</div>
</body>
</html>
